import { Injectable } from "@angular/core";
import { Story, Word } from "./types";

@Injectable({
  providedIn: 'root'
})
export class LevelService {
  constructor() { }

  getLevelOneWords(): Word[] {
    return [
      new Word(1, 'ВАШИНГТОН'),
      new Word(2, 'ЖЕШТИНА'),
      new Word(3, 'МАРИОНЕТКА'),
      new Word(4, 'СОЅВЕЗДИЕ'),
      new Word(5, 'ХУЛАХОП'),
      new Word(6, 'ЦАРСТВО'),
      new Word(7, 'ЉУБОМОРА'),
      new Word(8, 'КОЊУШНИЦА'),
      new Word(9, 'БЕРИЌЕТ'),
      new Word(10, 'УПАТСТВО'),
      new Word(11, 'КРОАСАН'),
      new Word(12, 'ЦИТАТ'),
      new Word(13, 'ДИЈАБЕТИЧАР'),
      new Word(14, 'ЛОКУМ'),
      new Word(15, 'ЃУМБИР'),
      new Word(16, 'ШПОРЕТ'),
      new Word(17, 'ОЏАЧАР'),
      new Word(18, 'ЗЕЛНИК'),
      new Word(19, 'ЧЕКАН'),
      new Word(20, 'ФРИЗЕРКА'),
      new Word(21, 'ЈАБОЛКНИЦА'),
      new Word(22, 'ПРИМОРЈЕ'),
      new Word(23, 'ДИЗАЈНЕР'),
      new Word(24, 'ЕДНОСТАВНО')
    ];
  }

  getLevelTwoWords(): string[] {
    return [
      "АВИОН",
      "БАЛОН",
      "ВИНОЖИТО",
      "ГОТВАЧ",
      "ДИНОСАУРУС",
      "ЃЕВРЕК",
      "ЕЛКА",
      "ЖИРАФА",
      "ЗАЈЧЕ",
      "ЅВОНЧЕ",
      "ИГЛА",
      "ЈАЈЦЕ",
      "КУЌА",
      "ЛИЖАВЧЕ",
      "ЉУБОВ",
      "МАЧЕ",
      "НОСОРОГ",
      "ЊУЈОРК",
      "ОГАН",
      "ПАУН",
      "РАДИО",
      "СОНЦЕ",
      "ТОРТА",
      "ЌУП",
      "УСТА",
      "ФОНТАНА",
      "ХЕЛИКОПТЕР",
      "ЦВЕКЛО",
      "ЧЕТКА",
      "ЏАМЛИИ",
      "ШАХ"
    ];
  }

  getLevelThreeStories(): Story[]{
    return [
      new Story(1, "криенка.png", "Мавко, Маја и Мила денес немаат домажна задача. По училиште излегоа надвор да играат криепка.", ["Мавко", "домажна", "криепка"]),
      new Story(2, "снешко.png", "Трите гопеми топки генс се претворија во утше поголем Снешко.", ["гопеми", "генс", "утше"]),
      new Story(3, "рагби.png", "Тренерот Роби денез ги учеше очениците како да играат рабги.", ["денез", "очениците", "рабги"]),
      new Story(4, "јаже.png", "Дина, Дајман и Дона играат скокање на јаже. Дина носи палави панталони и евд големи плетенки.", ["Дајман", "палави", "евд"]),
      new Story(5, "бенд.png", "Бредна, Бабон и Бојан се добри другари и заедно свират во бедн.", ["Бредна", "Бабон", "бедн"]),
      new Story(6, "фамилија.png", "Дедо Дене денес ни додје на гости. Тој ни донесе мнугу дарови", ["Дене", "додје", "мнугу"]),
      new Story(7, "цртање.png", "Кога сме на училитше Цветана секогаш црта ос црвена боја, а Симан со сина.", ["училитше", "ос", "Симан"]),
    ];
  }
}
